In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Harry", "Rohan", "Skillf", "Shubh"],
    "mark" : [92, 34, 24, 17],
    "city" : ["Ramput", "Kolkata", "Bareilly", "Antarctica"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  mark        city
0   Harry    92      Ramput
1   Rohan    34     Kolkata
2  Skillf    24    Bareilly
3   Shubh    17  Antarctica

In [5]:
df.to_csv("friends.csv") # used to convert into a csv file

In [6]:
df.to_csv("friends_index_false.csv", index = False) # used to remove index from my csv file

In [7]:
df.head(2) # show only two rows of starting

    name  mark     city
0  Harry    92   Ramput
1  Rohan    34  Kolkata

In [8]:
df.tail(2) #shows last two rows from end

     name  mark        city
2  Skillf    24    Bareilly
3   Shubh    17  Antarctica

In [9]:
df.describe()

           mark
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
harry = pd.read_csv("harry.csv")

In [11]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No.,Speed,City
0,0,0,0,0,12345,89,Rampur
1,1,1,1,1,893523,50,Kolkata
2,2,2,2,2,89323,23,Bareilly
3,3,3,3,3,923341,87,Antarctica

In [12]:
harry['Speed ']

0    89
1    50
2    23
3    87
Name: Speed , dtype: int64

In [13]:
harry["Speed "][1]

50

In [14]:
harry["Speed "][1] = 50

C:\Users\Nishant Badhautiya\AppData\Local\Temp\ipykernel_16708\131759082.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry["Speed "][1] = 50

In [15]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No.,Speed,City
0,0,0,0,0,12345,89,Rampur
1,1,1,1,1,893523,50,Kolkata
2,2,2,2,2,89323,23,Bareilly
3,3,3,3,3,923341,87,Antarctica

In [16]:
harry.to_csv("harry.csv")

In [17]:
harry.index = ['first', 'second', 'third', 'fourth']

In [18]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train No.,Speed,City
first,0,0,0,0,12345,89,Rampur
second,1,1,1,1,893523,50,Kolkata
third,2,2,2,2,89323,23,Bareilly
fourth,3,3,3,3,923341,87,Antarctica

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.764573
1     0.460900
2     0.869964
3     0.237331
4     0.387234
5     0.611745
6     0.832104
7     0.800377
8     0.537253
9     0.485395
10    0.532805
11    0.782162
12    0.718253
13    0.784867
14    0.841619
15    0.126679
16    0.723993
17    0.971735
18    0.718423
19    0.148009
20    0.935046
21    0.265675
22    0.251831
23    0.306986
24    0.003535
25    0.997844
26    0.283466
27    0.684407
28    0.822752
29    0.750393
30    0.217988
31    0.234859
32    0.005722
33    0.125523
dtype: float64

In [21]:
type(ser) #shows the type of ser as it's a series

pandas.core.series.Series

In [22]:
newdf = pd.DataFrame(np.random.rand(334, 5), index = np.arange(334))

In [23]:
newdf

            0         1         2         3         4
0    0.037177  0.916590  0.063555  0.775580  0.635909
1    0.328850  0.663012  0.966798  0.376088  0.072760
2    0.701520  0.976787  0.382041  0.355464  0.135462
3    0.706865  0.849711  0.363770  0.027698  0.083670
4    0.155703  0.233492  0.207222  0.167841  0.832134
..        ...       ...       ...       ...       ...
329  0.325210  0.347181  0.796104  0.150173  0.111795
330  0.361893  0.884685  0.819122  0.958579  0.865221
331  0.046728  0.116794  0.144389  0.372545  0.884433
332  0.743932  0.168863  0.988382  0.907513  0.560592
333  0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [24]:
newdf.head() #shows first five rows

          0         1         2         3         4
0  0.037177  0.916590  0.063555  0.775580  0.635909
1  0.328850  0.663012  0.966798  0.376088  0.072760
2  0.701520  0.976787  0.382041  0.355464  0.135462
3  0.706865  0.849711  0.363770  0.027698  0.083670
4  0.155703  0.233492  0.207222  0.167841  0.832134

In [25]:
type(newdf)

pandas.core.frame.DataFrame

In [26]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.520867    0.526216    0.496605    0.519227    0.500857
std      0.282777    0.300185    0.295575    0.291235    0.290627
min      0.000447    0.000734    0.003131    0.005308    0.004092
25%      0.272647    0.251157    0.229964    0.301226    0.253550
50%      0.551718    0.536649    0.494832    0.523629    0.532889
75%      0.769397    0.803969    0.774835    0.759831    0.764034
max      0.995237    0.996814    0.998310    0.997961    0.998566

In [27]:
newdf.dtypes #shows the data type of every  column

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
newdf[0][0] = "Harry" #now at [0][0] index it will make objext to our data type

C:\Users\Nishant Badhautiya\AppData\Local\Temp\ipykernel_16708\1829572401.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "Harry" #now at [0][0] index it will make objext to our data type

In [29]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf.head()

          0         1         2         3         4
0     Harry  0.916590  0.063555  0.775580  0.635909
1   0.32885  0.663012  0.966798  0.376088  0.072760
2   0.70152  0.976787  0.382041  0.355464  0.135462
3  0.706865  0.849711  0.363770  0.027698  0.083670
4  0.155703  0.233492  0.207222  0.167841  0.832134

In [31]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [32]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [33]:
newdf.to_numpy() # converts dataframe into numpy array

array([['Harry', 0.9165903001732432, 0.06355462973828763,
        0.7755800003789808, 0.6359090089602024],
       [0.3288495998569918, 0.6630124757662632, 0.9667984270199349,
        0.3760882543305849, 0.07275970618098382],
       [0.7015198578465266, 0.9767868455084001, 0.38204066211240884,
        0.35546386765279725, 0.13546221767141098],
       ...,
       [0.04672815986675838, 0.11679439549197035, 0.14438913728076652,
        0.37254466874463343, 0.8844333683660132],
       [0.7439318936405628, 0.16886297025932062, 0.988381775589416,
        0.9075125065386427, 0.5605924773629424],
       [0.14264901670274244, 0.03673799299015945, 0.86314432619127,
        0.16657751960251044, 0.02374515802290078]], dtype=object)

In [34]:
newdf[0][0] = 0.345334

In [35]:
newdf.head()

          0         1         2         3         4
0  0.345334  0.916590  0.063555  0.775580  0.635909
1   0.32885  0.663012  0.966798  0.376088  0.072760
2   0.70152  0.976787  0.382041  0.355464  0.135462
3  0.706865  0.849711  0.363770  0.027698  0.083670
4  0.155703  0.233492  0.207222  0.167841  0.832134

In [36]:
newdf.to_numpy()  # stills dtype is object

array([[0.345334, 0.9165903001732432, 0.06355462973828763,
        0.7755800003789808, 0.6359090089602024],
       [0.3288495998569918, 0.6630124757662632, 0.9667984270199349,
        0.3760882543305849, 0.07275970618098382],
       [0.7015198578465266, 0.9767868455084001, 0.38204066211240884,
        0.35546386765279725, 0.13546221767141098],
       ...,
       [0.04672815986675838, 0.11679439549197035, 0.14438913728076652,
        0.37254466874463343, 0.8844333683660132],
       [0.7439318936405628, 0.16886297025932062, 0.988381775589416,
        0.9075125065386427, 0.5605924773629424],
       [0.14264901670274244, 0.03673799299015945, 0.86314432619127,
        0.16657751960251044, 0.02374515802290078]], dtype=object)

In [37]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.345334,0.32885,0.70152,0.706865,0.155703,0.30334,0.256944,0.263406,0.390288,0.47357,...,0.855468,0.656415,0.593891,0.614705,0.5201,0.32521,0.361893,0.046728,0.743932,0.142649
1,0.91659,0.663012,0.976787,0.849711,0.233492,0.160916,0.023322,0.873337,0.2563,0.131554,...,0.357149,0.394105,0.596874,0.432994,0.50297,0.347181,0.884685,0.116794,0.168863,0.036738
2,0.063555,0.966798,0.382041,0.36377,0.207222,0.235334,0.021738,0.003131,0.860084,0.32486,...,0.441658,0.553315,0.971958,0.399489,0.446222,0.796104,0.819122,0.144389,0.988382,0.863144
3,0.77558,0.376088,0.355464,0.027698,0.167841,0.555026,0.415407,0.558141,0.981532,0.288986,...,0.018665,0.613239,0.933925,0.506415,0.301913,0.150173,0.958579,0.372545,0.907513,0.166578
4,0.635909,0.07276,0.135462,0.08367,0.832134,0.401881,0.763447,0.895404,0.198185,0.795671,...,0.698897,0.786257,0.076788,0.35971,0.426205,0.111795,0.865221,0.884433,0.560592,0.023745

In [38]:
newdf

            0         1         2         3         4
0    0.345334  0.916590  0.063555  0.775580  0.635909
1     0.32885  0.663012  0.966798  0.376088  0.072760
2     0.70152  0.976787  0.382041  0.355464  0.135462
3    0.706865  0.849711  0.363770  0.027698  0.083670
4    0.155703  0.233492  0.207222  0.167841  0.832134
..        ...       ...       ...       ...       ...
329   0.32521  0.347181  0.796104  0.150173  0.111795
330  0.361893  0.884685  0.819122  0.958579  0.865221
331  0.046728  0.116794  0.144389  0.372545  0.884433
332  0.743932  0.168863  0.988382  0.907513  0.560592
333  0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [1]:
newdf.sort_index(axis = 0, ascending = False) # by default ascending = True

NameError: name 'newdf' is not defined

In [40]:
newdf.sort_index(axis = 1, ascending = False)

            4         3         2         1         0
0    0.635909  0.775580  0.063555  0.916590  0.345334
1    0.072760  0.376088  0.966798  0.663012   0.32885
2    0.135462  0.355464  0.382041  0.976787   0.70152
3    0.083670  0.027698  0.363770  0.849711  0.706865
4    0.832134  0.167841  0.207222  0.233492  0.155703
..        ...       ...       ...       ...       ...
329  0.111795  0.150173  0.796104  0.347181   0.32521
330  0.865221  0.958579  0.819122  0.884685  0.361893
331  0.884433  0.372545  0.144389  0.116794  0.046728
332  0.560592  0.907513  0.988382  0.168863  0.743932
333  0.023745  0.166578  0.863144  0.036738  0.142649

[334 rows x 5 columns]

In [41]:
newdf.head()

          0         1         2         3         4
0  0.345334  0.916590  0.063555  0.775580  0.635909
1   0.32885  0.663012  0.966798  0.376088  0.072760
2   0.70152  0.976787  0.382041  0.355464  0.135462
3  0.706865  0.849711  0.363770  0.027698  0.083670
4  0.155703  0.233492  0.207222  0.167841  0.832134

In [42]:
newdf[0] #gives me the colument at index 0

0      0.345334
1       0.32885
2       0.70152
3      0.706865
4      0.155703
         ...
329     0.32521
330    0.361893
331    0.046728
332    0.743932
333    0.142649
Name: 0, Length: 334, dtype: object

In [43]:
type(newdf[0])

pandas.core.series.Series

In [44]:
newdf2 = newdf # now newdf2 is a view of newdf means change in newdf2 will change in newdf. and newdf2 is in the same memory location but point it like pointer

In [45]:
newdf2[0][0] = 344563444 # make change in newdf2 but there will be reflect in newdf also

In [46]:
newdf

             0         1         2         3         4
0    344563444  0.916590  0.063555  0.775580  0.635909
1      0.32885  0.663012  0.966798  0.376088  0.072760
2      0.70152  0.976787  0.382041  0.355464  0.135462
3     0.706865  0.849711  0.363770  0.027698  0.083670
4     0.155703  0.233492  0.207222  0.167841  0.832134
..         ...       ...       ...       ...       ...
329    0.32521  0.347181  0.796104  0.150173  0.111795
330   0.361893  0.884685  0.819122  0.958579  0.865221
331   0.046728  0.116794  0.144389  0.372545  0.884433
332   0.743932  0.168863  0.988382  0.907513  0.560592
333   0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [47]:
newdf2

             0         1         2         3         4
0    344563444  0.916590  0.063555  0.775580  0.635909
1      0.32885  0.663012  0.966798  0.376088  0.072760
2      0.70152  0.976787  0.382041  0.355464  0.135462
3     0.706865  0.849711  0.363770  0.027698  0.083670
4     0.155703  0.233492  0.207222  0.167841  0.832134
..         ...       ...       ...       ...       ...
329    0.32521  0.347181  0.796104  0.150173  0.111795
330   0.361893  0.884685  0.819122  0.958579  0.865221
331   0.046728  0.116794  0.144389  0.372545  0.884433
332   0.743932  0.168863  0.988382  0.907513  0.560592
333   0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [48]:
#newdf2 = newdf[:]  # it makes a copy so not change in newdf if i make change in newdf2
newdf3 = newdf.copy()

In [49]:
newdf2[0][0] = 3456

C:\Users\Nishant Badhautiya\AppData\Local\Temp\ipykernel_16708\944743121.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 3456

In [50]:
newdf2

            0         1         2         3         4
0        3456  0.916590  0.063555  0.775580  0.635909
1     0.32885  0.663012  0.966798  0.376088  0.072760
2     0.70152  0.976787  0.382041  0.355464  0.135462
3    0.706865  0.849711  0.363770  0.027698  0.083670
4    0.155703  0.233492  0.207222  0.167841  0.832134
..        ...       ...       ...       ...       ...
329   0.32521  0.347181  0.796104  0.150173  0.111795
330  0.361893  0.884685  0.819122  0.958579  0.865221
331  0.046728  0.116794  0.144389  0.372545  0.884433
332  0.743932  0.168863  0.988382  0.907513  0.560592
333  0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [51]:
newdf

            0         1         2         3         4
0        3456  0.916590  0.063555  0.775580  0.635909
1     0.32885  0.663012  0.966798  0.376088  0.072760
2     0.70152  0.976787  0.382041  0.355464  0.135462
3    0.706865  0.849711  0.363770  0.027698  0.083670
4    0.155703  0.233492  0.207222  0.167841  0.832134
..        ...       ...       ...       ...       ...
329   0.32521  0.347181  0.796104  0.150173  0.111795
330  0.361893  0.884685  0.819122  0.958579  0.865221
331  0.046728  0.116794  0.144389  0.372545  0.884433
332  0.743932  0.168863  0.988382  0.907513  0.560592
333  0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [52]:
newdf.loc[0,0] = 333

In [53]:
newdf.head(3)

         0         1         2         3         4
0      333  0.916590  0.063555  0.775580  0.635909
1  0.32885  0.663012  0.966798  0.376088  0.072760
2  0.70152  0.976787  0.382041  0.355464  0.135462

In [54]:
list("ABCDE")

['A', 'B', 'C', 'D', 'E']

In [55]:
newdf.columns = list("ABCDE")

In [56]:
newdf

            A         B         C         D         E
0         333  0.916590  0.063555  0.775580  0.635909
1     0.32885  0.663012  0.966798  0.376088  0.072760
2     0.70152  0.976787  0.382041  0.355464  0.135462
3    0.706865  0.849711  0.363770  0.027698  0.083670
4    0.155703  0.233492  0.207222  0.167841  0.832134
..        ...       ...       ...       ...       ...
329   0.32521  0.347181  0.796104  0.150173  0.111795
330  0.361893  0.884685  0.819122  0.958579  0.865221
331  0.046728  0.116794  0.144389  0.372545  0.884433
332  0.743932  0.168863  0.988382  0.907513  0.560592
333  0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [57]:
# newdf.loc[0,0] = 323
newdf.loc[0,'A'] = 3231

In [58]:
newdf

            A         B         C         D         E
0        3231  0.916590  0.063555  0.775580  0.635909
1     0.32885  0.663012  0.966798  0.376088  0.072760
2     0.70152  0.976787  0.382041  0.355464  0.135462
3    0.706865  0.849711  0.363770  0.027698  0.083670
4    0.155703  0.233492  0.207222  0.167841  0.832134
..        ...       ...       ...       ...       ...
329   0.32521  0.347181  0.796104  0.150173  0.111795
330  0.361893  0.884685  0.819122  0.958579  0.865221
331  0.046728  0.116794  0.144389  0.372545  0.884433
332  0.743932  0.168863  0.988382  0.907513  0.560592
333  0.142649  0.036738  0.863144  0.166578  0.023745

[334 rows x 5 columns]

In [59]:
newdf = newdf.drop(0, axis = 1) # drop the column 0 from axis 1

KeyError: '[0] not found in axis'

In [ ]:
newdf

In [ ]:
newdf.loc[[1,2], ['C', 'D']] # gives first and second rows with C and D  columns

In [ ]:
newdf.loc[:, ['C', 'D']]  #gives all the rows with C and D columns

In [ ]:
newdf.loc[[1,2], :]  #gives all the columns with 1 and 2 rows

In [ ]:
newdf.loc[(newdf['A'] < 0.3)]  # run complex query like in database here i select all the columns A where their value is less than 0.3

In [ ]:
newdf.loc[(newdf['A'] < 0.3) & (newdf['C'] > 0.1)]

In [ ]:
newdf.head()

In [ ]:
newdf.iloc[0,4]  #ilock useful when we wants to get result by providing index whereous .loc used when we don't give number so we have to give the name of our column

In [ ]:
newdf.iloc[[0,5], [1,2]]

In [ ]:
newdf.head(3)

In [ ]:
newdf.drop([0]) #drops the 0th rows by default axis is 0

In [ ]:
# newdf.drop(['A'], axis = 1)
newdf.drop(['A', 'C'], axis = 1) # drop A and C column

In [ ]:
newdf

In [ ]:
newdf.drop(['A', 'D'], axis = 1, inplace = True) # drop A and C column permanently at their place so inplace means modify the original dataframe

In [ ]:
newdf

In [ ]:
newdf.drop([1,5], axis = 0, inplace = True) # drop A and C column permanently at their place so inplace means modify the original dataframe

In [ ]:
newdf

In [ ]:
newdf.reset_index() #reset the index but it also adds a new column by name of index

In [ ]:
newdf.reset_index(drop = True, inplace = True) # now it will drop our index column

In [ ]:
newdf

In [ ]:
# how to remove nulls(nan) from pandas
# how to remove duplicates in pandas 
newdf['B'].isnull() # returns all values where column B is null

In [ ]:
newdf.loc[:, ['B']] = None

In [ ]:
newdf

In [ ]:
newdf['B'].isnull()

In [ ]:
newdf.loc[:, ['B']] = 56

In [ ]:
newdf

In [ ]:
df = pd.DataFrame({"name":['Alfred', 'Batman', 'Catwoman'],
                   "toy" : [np.nan, 'Batmobile', 'Bullwhip'], 
                   "born" : [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [ ]:
df

In [ ]:
df.dropna(how = 'all') # drops nan and NaT valued rows where all the values are nan and NaT

In [ ]:
df = pd.DataFrame({"name":['Alfred', 'Batman', 'Catwoman'],
                   "toy" : [np.nan, np.nan, pd.NaT], 
                   "born" : [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [ ]:
df.dropna(how = 'all', axis = 1) # goes to the axis 1 and drop that column which have all element set to nan or NaT

In [ ]:
df = pd.DataFrame({"name":['Alfred', 'Batman', 'Alfred'],
                   "toy" : [np.nan, 'Batmobile', 'Bullwhip'], 
                   "born" : [pd.NaT, pd.Timestamp("1940-04-25"), pd.NaT]})

In [ ]:
df

In [ ]:
df.drop_duplicates()  # nothing will happen

In [ ]:
df.drop_duplicates(subset = ['name']) # removes the duplicates from the name column

In [ ]:
df

In [ ]:
df.drop_duplicates(subset = ['name'], keep = 'first')  # keeps the first rows

In [ ]:
df.drop_duplicates(subset = ['name'], keep = 'last') # keeps the last rows

In [ ]:
df.drop_duplicates(subset = ['name'], keep = False)  # remove all duplicates columns where name column have duplicates

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df['name'].value_counts(dropna = False)  # don't count nan or NaT in name column

In [ ]:
df['toy'].value_counts(dropna = False)

In [ ]:
df['toy'].value_counts(dropna = True)

In [ ]:
df.notnull()

In [ ]:
df.isnull()

In [ ]:
# # create a dataframe and run the following methods on them
# df.describe()
# df.mean()
# df.corr()
# df.count()
# df.max()
# df.min()
# df.median()
# df.std()

In [ ]:
data = pd.read_excel('data.xlsx')

In [ ]:
data

In [ ]:
data = pd.read_excel('data.xlsx', sheet_name = 'Sheet1')

In [ ]:
data

In [ ]:
data = pd.read_excel('data.xlsx', sheet_name = 'Sheet2')

In [ ]:
data

In [ ]:
data.iloc[0,0] = 34

In [ ]:
data

In [ ]:
data.to_excel('data.xlsx', sheet_name = 'Sheet2')  # it will remove the sheet1 and make change in sheet2 so only sheet2 will remain in data.xlsx file